import { Education } from '@/types';

export const educations: Education[] = [
  {
    type: '코드잇 스프린트 - 프론트엔드 단기심화 3기',
    time: '2024.08-2023.10',
    place: '(주)코드잇',
    info: '같은 프론트엔드 팀원들과의 협업 경험 및 팀장을 맡아 프로젝트를 리드하는 경험을 하였습니다.',
  },
  {
    type: '메가테라 - 프론트엔드 생존코스 3기',
    time: '2023.04-2023.07',
    place: '(주)시드웨일',
    info: 'React 핵심 개념, Test, 상태 관리 등등 프론트엔드 핵심 기술에 대해서 학습하였습니다.',
  },
  {
    type: '구공팩토리 - 부트캠프',
    time: '2021.02-2021.05',
    place: '(주)흥미랩',
    info: '90일 간의 코딩 프로젝트 프로그램(프론트엔드 과정)',
  },
  {
    type: '스파르타 코딩클럽',
    time: '2020.12-2021.02',
    place: '팀스파르타(주)',
    info: '온라인 개발 교육 플랫폼(웹개발 기본교육 수료)',
  },
];
